{
    "about": {
      "introduction1": "Je suis un développeur front-end passionné, avec un grand intérêt pour la création d'applications web dynamiques et interactives.",
      "introduction2": "Spécialisé en React, JavaScript et CSS, je m'attache à livrer des conceptions créatives avec un code propre et réactif. J'ai perfectionné mes compétences grâce à de nombreux cours en ligne, me poussant toujours à apprendre les derniers outils et technologies qui améliorent l'expérience utilisateur.",
      "introduction3": " Je suis actuellement à la recherche d'opportunités pour travailler dans un environnement collaboratif où je peux utiliser mon expertise en React pour développer des projets impactants.",
      "formation1": "Lycée Sidi Ouagag",
      "subformation1": "Baccalauréat en Sciences Physiques",
      "formation2": "ISTA : Institut Spécialisé de Technologie Appliquée_Taddart Agadir",
      "subformation2": "DIPLÔME DE TECHNICIEN SPÉCIALISÉ EN DÉVELOPPEMENT WEB FULL STACK",
      "formation3": "Stage d'un mois chez Vala Bleu",
      "subformation3": "J'ai créé un site e-commerce en utilisant React et CSS, avec Sanity pour la gestion de contenu"
    },
    "projects": {
    "cryptoAppName": "Crypto App",
    "weatherAppName": "Weather App",
    "cryptoAppTitle": "SuiviCrypto est une application web React qui suit en temps réel les données des crypto-monnaies, intégrant CoinGecko, CoinLore et des graphiques interactifs de TradingView pour des analyses complètes",
    "weatherAppTitle": "MétéoApp est une application web React qui fournit des prévisions météorologiques en temps réel via l'API OpenWeatherMap, avec recherche par ville et conversion Celsius/Fahrenheit.",
    "cryptoAppDescription": "SuiviCrypto est une application web développée avec React qui permet aux utilisateurs de suivre les données de crypto-monnaies en temps réel. Elle récupère des données à partir de deux API différentes, CoinGecko et CoinLore, pour fournir des informations complètes sur diverses crypto-monnaies. Les utilisateurs peuvent consulter des informations détaillées sur chaque crypto-monnaie, notamment la capitalisation boursière, les variations de prix, le volume, et plus encore. De plus, SuiviCrypto propose des graphiques interactifs alimentés par TradingView pour visualiser les tendances des crypto-monnaies. Que vous soyez un investisseur chevronné ou simplement curieux du marché des crypto-monnaies, SuiviCrypto offre des informations précieuses sur le monde des monnaies numériques.",
    "weatherAppDescription": "MétéoApp est une application web construite avec React qui permet aux utilisateurs de consulter les prévisions météorologiques en temps réel. Elle utilise l'API OpenWeatherMap pour récupérer les données météorologiques actuelles et les prévisions à court terme pour une ville donnée. Les utilisateurs peuvent également rechercher des prévisions météorologiques pour différentes villes en saisissant le nom de la ville dans la barre de recherche. MétéoApp offre une interface conviviale avec des icônes météorologiques intuitives pour faciliter la compréhension des conditions météorologiques. De plus, les utilisateurs ont la possibilité de basculer entre les unités de température Celsius et Fahrenheit en appuyant sur un bouton",
    "cryptoAppSkills": "React.js · JavaScript · React Router · API Context (pour la gestion de l'état) · Widget TradingView (pour les graphiques interactifs) · CSS (pour le stylage) · API CoinGecko (pour les données sur les crypto-monnaies · API CoinLore (pour les données sur les crypto-monnaies)",
    "weatherAppSkills": "React.js · JavaScript · CSS (pour le stylage) · API Context (pour la gestion de l'état) · API OpenWeatherMap (pour les données météorologiques) · Axios (pour les requêtes HTTP)"
  }
  }
  